# Pandas

In [1]:
#pandas
#pandas is a python library built on the top of numpy ,having various functions and methods that are used for data analysis
#and data manipualtion.
#pandas having 2 type of data stuctures 
#1.Series = it is a one dimensional data  stucture like 1-dimensional labelled arrays capable of holding any type of data like
#integer,float,string,python object etc.
#2.DataFrame = It  is a 2-dimensional stucture in pandas like 2-dimensional arrays or a table with rows and columns.

# Series

In [2]:
import pandas as pd
#Series
#syntax
#s=pd.Series(data,index)
#series can be created using inputs like list,dictionary,arrays etc

In [3]:
#list
s=pd.Series([1,2,3])
s

0    1
1    2
2    3
dtype: int64

In [5]:
#with arrays
import numpy as np
data=np.array([4,5,6])
data

array([4, 5, 6])

In [6]:
s=pd.Series(data)
s

0    4
1    5
2    6
dtype: int32

In [7]:
s=pd.Series(data,index=["a","b","c"])
s

a    4
b    5
c    6
dtype: int32

In [8]:
s=pd.Series(5,index=["a","b","c","d"])
s

a    5
b    5
c    5
d    5
dtype: int64

In [9]:
s=pd.Series(5)
s

0    5
dtype: int64

In [10]:
s=pd.Series(5,index=[1,2])
s

1    5
2    5
dtype: int64

In [11]:
#series with dictionary 
#dict keys are used to construct the index
data={"a":0,"b":1,"c":2}
s=pd.Series(data)
s

a    0
b    1
c    2
dtype: int64

In [12]:
data={"a":0,"b":1,"c":"g"}
s=pd.Series(data,index=["b","c","d","a"])
s

b      1
c      g
d    NaN
a      0
dtype: object

In [13]:
#NaN Not a Number

# DataFrame

In [14]:
#DataFrame
#syntax  df=pd.DataFrame(data,index,columns)
#dataframe can  be created using list,dictionary,Series,numpy arrays,another dataframe.
data=[["Alex",10],["Bob",12],["Jim",14]]
df=pd.DataFrame(data,columns=["Name","Age"])
df

   Name  Age
0  Alex   10
1   Bob   12
2   Jim   14

In [15]:
#from dictionary of lists
#**#dict keys are used as column names in dataframe
data={"Name":["Tom","Jack","Steve","Ricky"],"Age":[20,21,12,17]}
df=pd.DataFrame(data)
df

    Name  Age
0    Tom   20
1   Jack   21
2  Steve   12
3  Ricky   17

In [16]:
x={"city":["pune","mumbai","kolhapur","sangli"],"place":["kothrud","marine drive","rankala","tasgaon"]}
df=pd.DataFrame(x)
df

       city         place
0      pune       kothrud
1    mumbai  marine drive
2  kolhapur       rankala
3    sangli       tasgaon

In [17]:
data=[{'a':1,'b':2,'c':3},{'a':5,'b':10,'c':20}]
df=pd.DataFrame(data)
df

   a   b   c
0  1   2   3
1  5  10  20

In [18]:
#NaN is not a datatype.because its not a scaler value

In [19]:
#from dictionary of series
import pandas as pd
d={'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
df=pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

## making new column using existing column

In [31]:
df['Three']=df['one']+df['two']

In [32]:
df

   one  two  Three
a  1.0    1    2.0
b  2.0    2    4.0
c  3.0    3    6.0
d  NaN    4    NaN

In [33]:
df['Four']=pd.Series([10,20,30],index=['a','b','c'])

In [34]:
df

   one  two  Three  Four
a  1.0    1    2.0  10.0
b  2.0    2    4.0  20.0
c  3.0    3    6.0  30.0
d  NaN    4    NaN   NaN

In [35]:
del df['Four']

In [36]:
df

   one  two  Three
a  1.0    1    2.0
b  2.0    2    4.0
c  3.0    3    6.0
d  NaN    4    NaN

In [37]:
df.pop('Three') #it drops the coulmn and shows that column here three is dropped and it is shown

a    2.0
b    4.0
c    6.0
d    NaN
Name: Three, dtype: float64

In [1]:
import numpy as np
import pandas as pd
x={"city":["pune","mumbai","kolhapur","sangli"],"place":["kothrud","marine drive","rankala","tasgaon"]}
df=pd.DataFrame(x)
df

       city         place
0      pune       kothrud
1    mumbai  marine drive
2  kolhapur       rankala
3    sangli       tasgaon

## 16-3-2022

In [3]:
#Row Selection works on 
df.iloc[0]              #it will only work for numbers
                        #loc  will work for string and numbers

city        pune
place    kothrud
Name: 0, dtype: object

In [4]:
df.loc[0]

city        pune
place    kothrud
Name: 0, dtype: object

In [5]:
#Addition of rows
df1 = pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df1

   a  b
0  1  2
1  3  4

In [6]:
df2 = pd.DataFrame([[5,6],[7,8]],columns=['a','b'])
df2

   a  b
0  5  6
1  7  8

In [7]:
#using append function
df=df1.append(df2)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

# Series Basic functionalities

In [8]:
# Series Basic functionalities
import pandas as pd
import numpy as np
s=pd.Series(np.random.randn(4))
s

0    0.369579
1   -1.688482
2    1.348242
3   -1.087404
dtype: float64

In [9]:
#ndim 
s.ndim

1

In [10]:
#axes it will show the range of the index
s.axes

[RangeIndex(start=0, stop=4, step=1)]

In [11]:
#size it will say how many elements are in the series
s.size

4

In [12]:
#values 
#it gives actual data in the series in the form of array
s.values

array([ 0.36957905, -1.68848241,  1.34824191, -1.08740413])

In [13]:
#Head and Tail
#head = it returns first n rows
#tail = it returns last n rows
s.head(2)

0    0.369579
1   -1.688482
dtype: float64

# DataFrame Functionalities

In [14]:
d={'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
                   "Age":pd.Series([25,26,25,23,30,29,23]),"Rating":pd.Series([4.23,3.2,3.98,2.56,3.8,4,6,3.20])}
df=pd.DataFrame(d)
df

    Name   Age  Rating
0    Tom  25.0    4.23
1  James  26.0    3.20
2  Ricky  25.0    3.98
3    Vin  23.0    2.56
4  Steve  30.0    3.80
5  Smith  29.0    4.00
6   Jack  23.0    6.00
7    NaN   NaN    3.20

In [15]:
df.ndim

2

In [16]:
df.axes

[RangeIndex(start=0, stop=8, step=1),
 Index(['Name', 'Age', 'Rating'], dtype='object')]

In [17]:
#size means the no. elements in the dataframe
df.size

24

In [18]:
df.values

array([['Tom', 25.0, 4.23],
       ['James', 26.0, 3.2],
       ['Ricky', 25.0, 3.98],
       ['Vin', 23.0, 2.56],
       ['Steve', 30.0, 3.8],
       ['Smith', 29.0, 4.0],
       ['Jack', 23.0, 6.0],
       [nan, nan, 3.2]], dtype=object)

In [19]:
#T = transpose
#it interchanges rows and columns
df.T

           0      1      2     3      4      5     6    7
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack  NaN
Age     25.0   26.0   25.0  23.0   30.0   29.0  23.0  NaN
Rating  4.23    3.2   3.98  2.56    3.8    4.0   6.0  3.2

In [20]:
#shape
#it gives a tuple showing no.of rows and columns
df.shape

(8, 3)

In [21]:
df.head(4)

    Name   Age  Rating
0    Tom  25.0    4.23
1  James  26.0    3.20
2  Ricky  25.0    3.98
3    Vin  23.0    2.56

In [22]:
df.head()

    Name   Age  Rating
0    Tom  25.0    4.23
1  James  26.0    3.20
2  Ricky  25.0    3.98
3    Vin  23.0    2.56
4  Steve  30.0    3.80

In [23]:
df.tail(3)

    Name   Age  Rating
5  Smith  29.0     4.0
6   Jack  23.0     6.0
7    NaN   NaN     3.2

## descriptive statistics

In [24]:
#descriptive statistics
#sum()
#it returns the sum along requested axis
df.sum(axis=0) #when we apply any function like sum,mean,std etc then consider axis 0 as column and axis 1 as row

C:\Users\DJ\AppData\Local\Temp/ipykernel_756/3191283653.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=0) #when we apply any function like sum,mean,std etc then consider axis 0 as column and axis 1 as row

Age       181.00
Rating     30.97
dtype: float64

In [26]:
df.sum(axis=1)     #axis =1 as row

C:\Users\DJ\AppData\Local\Temp/ipykernel_756/37691222.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1)     #axis =1 as row

0    29.23
1    29.20
2    28.98
3    25.56
4    33.80
5    33.00
6    29.00
7     3.20
dtype: float64

In [27]:
#mean()  -its a average value
df.mean(axis=0)

C:\Users\DJ\AppData\Local\Temp/ipykernel_756/3674993332.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=0)

Age       25.857143
Rating     3.871250
dtype: float64

In [28]:
df.mean() #default axis=0

C:\Users\DJ\AppData\Local\Temp/ipykernel_756/867145895.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean() #default axis=0

Age       25.857143
Rating     3.871250
dtype: float64

In [29]:
#std standard deviation
df.std()

C:\Users\DJ\AppData\Local\Temp/ipykernel_756/3691837250.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

Age       2.734262
Rating    1.022203
dtype: float64

In [30]:
df

    Name   Age  Rating
0    Tom  25.0    4.23
1  James  26.0    3.20
2  Ricky  25.0    3.98
3    Vin  23.0    2.56
4  Steve  30.0    3.80
5  Smith  29.0    4.00
6   Jack  23.0    6.00
7    NaN   NaN    3.20

In [31]:
#count() it counts the number of elements in each column
df.count()

Name      7
Age       7
Rating    8
dtype: int64

In [32]:
#df.info()
#it returns the column names with all information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      float64
 2   Rating  8 non-null      float64
dtypes: float64(2), object(1)
memory usage: 320.0+ bytes

In [33]:
#max()
df.max()

C:\Users\DJ\AppData\Local\Temp/ipykernel_756/3332010240.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.max()

Age       30.0
Rating     6.0
dtype: float64

In [34]:
df.min()

C:\Users\DJ\AppData\Local\Temp/ipykernel_756/3962516015.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.min()

Age       23.00
Rating     2.56
dtype: float64

In [35]:
#describe() it is used to detect the outlier
df.describe()

             Age    Rating
count   7.000000  8.000000
mean   25.857143  3.871250
std     2.734262  1.022203
min    23.000000  2.560000
25%    24.000000  3.200000
50%    25.000000  3.890000
75%    27.500000  4.057500
max    30.000000  6.000000

In [36]:
import numpy as np

In [37]:
a = np.array([[10, 7, 4], [3, 2, 1]])
a

array([[10,  7,  4],
       [ 3,  2,  1]])

In [38]:
np.percentile(a,50)

3.5

In [39]:
np.percentile(a,75)

6.25

In [40]:
np.percentile(a,25)

2.25

In [41]:
#set_index
#if you want to set a column as a index you can use this function
df

    Name   Age  Rating
0    Tom  25.0    4.23
1  James  26.0    3.20
2  Ricky  25.0    3.98
3    Vin  23.0    2.56
4  Steve  30.0    3.80
5  Smith  29.0    4.00
6   Jack  23.0    6.00
7    NaN   NaN    3.20

In [42]:
df.set_index('Name')

        Age  Rating
Name
Tom    25.0    4.23
James  26.0    3.20
Ricky  25.0    3.98
Vin    23.0    2.56
Steve  30.0    3.80
Smith  29.0    4.00
Jack   23.0    6.00
NaN     NaN    3.20

In [43]:
#to see column names we use df.columns
df.columns

Index(['Name', 'Age', 'Rating'], dtype='object')

# sorting

In [44]:
#sorting
#sort_index() it sorts only index
df=pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns=['col1','col2'])
df

       col1      col2
1 -1.712443  1.474950
4 -0.107451  0.140930
6  0.063995 -1.129217
2  0.992961 -0.503865
3  0.411057  0.623011
5 -0.347996 -0.043420
9 -1.236214  1.399281
8  1.829059  2.171557
0  0.019285 -0.890532
7 -0.298559 -0.232989

In [45]:
x=df.sort_index()
x

       col1      col2
0  0.019285 -0.890532
1 -1.712443  1.474950
2  0.992961 -0.503865
3  0.411057  0.623011
4 -0.107451  0.140930
5 -0.347996 -0.043420
6  0.063995 -1.129217
7 -0.298559 -0.232989
8  1.829059  2.171557
9 -1.236214  1.399281

In [46]:
#sort_values()
#by argument uses the column name
import pandas as pd
df=pd.DataFrame({'col1':[2,1,5,56,10],"col2":[1,3,2,4,45]})
df

   col1  col2
0     2     1
1     1     3
2     5     2
3    56     4
4    10    45

In [47]:
df.sort_values(by='col1')

   col1  col2
1     1     3
0     2     1
2     5     2
4    10    45
3    56     4

In [48]:
df.sort_values(by='col2')

   col1  col2
0     2     1
2     5     2
1     1     3
3    56     4
4    10    45

### selecting data

In [49]:
#selecting data
#df.loc[]
import pandas as pd
import numpy as np
df=pd.DataFrame(np.random.randn(8,4),index=['a','b','c','d','e','f','g','h'],columns=['A','B','C','D'])
df

          A         B         C         D
a  0.062108 -1.353750  1.542159 -0.646970
b  0.663870  0.047964 -0.417292 -0.598871
c -0.976076  0.508420  0.761802 -1.399495
d -0.256083  1.227684  0.714433 -1.039955
e  0.645163 -0.874066  1.251954 -0.276871
f -1.344783 -0.362884  0.492242 -1.467776
g  3.200691 -0.199972 -0.203649 -0.774406
h  0.744959  0.003202 -0.882577  1.246594

In [50]:
df.loc['b']

A    0.663870
B    0.047964
C   -0.417292
D   -0.598871
Name: b, dtype: float64

In [51]:
#selecting all rows for a specific column
df.loc[:,'A']    #: means all

a    0.062108
b    0.663870
c   -0.976076
d   -0.256083
e    0.645163
f   -1.344783
g    3.200691
h    0.744959
Name: A, dtype: float64

In [52]:
df.loc[:,'D']

a   -0.646970
b   -0.598871
c   -1.399495
d   -1.039955
e   -0.276871
f   -1.467776
g   -0.774406
h    1.246594
Name: D, dtype: float64

In [53]:
#selecting all rows for a multiple columns
df.loc[:,['A','C']]

          A         C
a  0.062108  1.542159
b  0.663870 -0.417292
c -0.976076  0.761802
d -0.256083  0.714433
e  0.645163  1.251954
f -1.344783  0.492242
g  3.200691 -0.203649
h  0.744959 -0.882577

In [54]:
df.loc[:,['A','C','D']]

          A         C         D
a  0.062108  1.542159 -0.646970
b  0.663870 -0.417292 -0.598871
c -0.976076  0.761802 -1.399495
d -0.256083  0.714433 -1.039955
e  0.645163  1.251954 -0.276871
f -1.344783  0.492242 -1.467776
g  3.200691 -0.203649 -0.774406
h  0.744959 -0.882577  1.246594

In [55]:
#selecting few rows for particular columns
df.loc[['a','c','e','g'],['A','B','C']]

          A         B         C
a  0.062108 -1.353750  1.542159
c -0.976076  0.508420  0.761802
e  0.645163 -0.874066  1.251954
g  3.200691 -0.199972 -0.203649

In [56]:
df.loc[['a','c','e','g'],:]

          A         B         C         D
a  0.062108 -1.353750  1.542159 -0.646970
c -0.976076  0.508420  0.761802 -1.399495
e  0.645163 -0.874066  1.251954 -0.276871
g  3.200691 -0.199972 -0.203649 -0.774406

In [57]:
df.loc['a':"e",:]

          A         B         C         D
a  0.062108 -1.353750  1.542159 -0.646970
b  0.663870  0.047964 -0.417292 -0.598871
c -0.976076  0.508420  0.761802 -1.399495
d -0.256083  1.227684  0.714433 -1.039955
e  0.645163 -0.874066  1.251954 -0.276871

In [58]:
df

          A         B         C         D
a  0.062108 -1.353750  1.542159 -0.646970
b  0.663870  0.047964 -0.417292 -0.598871
c -0.976076  0.508420  0.761802 -1.399495
d -0.256083  1.227684  0.714433 -1.039955
e  0.645163 -0.874066  1.251954 -0.276871
f -1.344783 -0.362884  0.492242 -1.467776
g  3.200691 -0.199972 -0.203649 -0.774406
h  0.744959  0.003202 -0.882577  1.246594

In [59]:
df.iloc[0:5,:]

          A         B         C         D
a  0.062108 -1.353750  1.542159 -0.646970
b  0.663870  0.047964 -0.417292 -0.598871
c -0.976076  0.508420  0.761802 -1.399495
d -0.256083  1.227684  0.714433 -1.039955
e  0.645163 -0.874066  1.251954 -0.276871

In [60]:
#iloc()
df.iloc[1:5,2:4]

          C         D
b -0.417292 -0.598871
c  0.761802 -1.399495
d  0.714433 -1.039955
e  1.251954 -0.276871

In [61]:
df.loc["b":"e",['C','D']]

          C         D
b -0.417292 -0.598871
c  0.761802 -1.399495
d  0.714433 -1.039955
e  1.251954 -0.276871

In [62]:
df.iloc[1:3,:]

          A         B         C         D
b  0.663870  0.047964 -0.417292 -0.598871
c -0.976076  0.508420  0.761802 -1.399495

In [63]:
df.iloc[:,1:3]

          B         C
a -1.353750  1.542159
b  0.047964 -0.417292
c  0.508420  0.761802
d  1.227684  0.714433
e -0.874066  1.251954
f -0.362884  0.492242
g -0.199972 -0.203649
h  0.003202 -0.882577

## concatenation and merging

In [64]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}
df1=pd.DataFrame(data_one)
df1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [65]:
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}
df2=pd.DataFrame(data_two)
df2

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [68]:
df=pd.concat([df1,df2],axis=1)
df                                   #axis=1 column conact is not inbuilt function

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [69]:
pd.concat([df1,df2],axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

### merging

### pd.merge(left,right,on="comman column",how='inner')
### left=first df
### right=second df
### on = consider comman column in 2 dataframes and merge on that column

In [70]:
import pandas as pd
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [71]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [72]:
df=pd.merge(registrations,logins,on='name') #how='inner' is bydefault
df

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [73]:
pd.merge(registrations,logins,on="name",how='inner')
#how='inner' means it will take comman records in both tables

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [74]:
pd.merge(registrations,logins,on="name",how='left')
#how=left ,it will select all records from left(dataframe1) and comman records from right(dataframe2)

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [75]:
pd.merge(registrations,logins,on="name",how='right')
#how=right ,it will select all records from right(dataframe2) and comman records from left(dataframe1)

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [76]:
pd.merge(registrations,logins,on="name",how='outer')
#how= outer ,it will select all records from both tables

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [77]:
registrations = registrations.set_index("name")
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [78]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [79]:
#no comman column in both dataframes
pd.merge(registrations,logins,left_index=True,right_on='name')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [80]:
registrations = registrations.reset_index()
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [81]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [82]:
registrations.columns=['reg_name','reg_id']
registrations
#column name is changed

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [83]:
pd.merge(registrations,logins,left_on='reg_name',right_on='name')

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [84]:
registrations.columns=['name','id']
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [85]:
logins.columns=['id','name']
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [88]:
pd.merge(registrations,logins,on='name')   #both dataframe column name is same hence it gives suffix

     name  id_x  id_y
0  Andrew     1     2
1    Bobo     2     4

In [89]:
pd.merge(registrations,logins,on='name',suffixes=('_reg','_log'))

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4

In [90]:
left = pd.DataFrame({'id':[1,2,3,4,5],'name':['Andrew','Alex','Amy','Aallen','Alice'],'subject_id':['sub1','sub2','sub4','sub6',
                                                                                                  'sub5']})
left

   id    name subject_id
0   1  Andrew       sub1
1   2    Alex       sub2
2   3     Amy       sub4
3   4  Aallen       sub6
4   5   Alice       sub5

In [91]:
right = pd.DataFrame({'id':[1,2,3,4,5],'name':['Billy','Brain','Bran','Betty','Bryce'],'subject_id':['sub2','sub4','sub3','sub6',
                                                                                                  'sub5']})
right

   id   name subject_id
0   1  Billy       sub2
1   2  Brain       sub4
2   3   Bran       sub3
3   4  Betty       sub6
4   5  Bryce       sub5

In [92]:
pd.merge(left,right,on='subject_id')

   id_x  name_x subject_id  id_y name_y
0     2    Alex       sub2     1  Billy
1     3     Amy       sub4     2  Brain
2     4  Aallen       sub6     4  Betty
3     5   Alice       sub5     5  Bryce

In [93]:
pd.merge(left,right,on='subject_id',how='left')

   id_x  name_x subject_id  id_y name_y
0     1  Andrew       sub1   NaN    NaN
1     2    Alex       sub2   1.0  Billy
2     3     Amy       sub4   2.0  Brain
3     4  Aallen       sub6   4.0  Betty
4     5   Alice       sub5   5.0  Bryce

## groupby

In [94]:
#groupby
#groupby allows us to group together rows based of a column and perform an aggregate function on them
#aggregate functions=sum,mean,median,std,count etc
import pandas as pd
df=pd.DataFrame({"col1":['A','B','A','C','A','C','B'],"col2":[2,1,4,5,6,3,8]})
df

  col1  col2
0    A     2
1    B     1
2    A     4
3    C     5
4    A     6
5    C     3
6    B     8

In [ ]:
#groupby col1
'''col1  col2      col1   col2
A      2         A      12
A      4         B       9
A      6         C       8
B      1       
B      8
C      5
C      3
#sum is the agg func here'''

In [95]:
df.groupby('col1')

In [96]:
df.groupby('col1').sum()

      col2
col1
A       12
B        9
C        8

In [97]:
df.groupby('col1').mean()

      col2
col1
A      4.0
B      4.5
C      4.0

In [98]:
import pandas as pd
data={'company':['GOG','GOG','MSFT','MSFT','FB','FB'],"person":['sam','charlie','amy','vanessa','carl','sarah']
     ,"sales":[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  company   person  sales
0     GOG      sam    200
1     GOG  charlie    120
2    MSFT      amy    340
3    MSFT  vanessa    124
4      FB     carl    243
5      FB    sarah    350

In [99]:
df.groupby('company')

In [100]:
df.groupby('company').mean()

         sales
company
FB       296.5
GOG      160.0
MSFT     232.0

In [101]:
df.groupby('company').std()

              sales
company
FB        75.660426
GOG       56.568542
MSFT     152.735065

In [102]:
df.groupby('company').count()

         person  sales
company
FB            2      2
GOG           2      2
MSFT          2      2

In [103]:
df.groupby('company').max()

          person  sales
company
FB         sarah    350
GOG          sam    200
MSFT     vanessa    340

In [104]:
df.groupby('company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [105]:
ipl_data={'Team':['Riders','Riders','Devils','Devils','Kings','Kings','Kings','Kings','Riders','Royals','Royals','Riders'],
         "Rank":[1,2,2,3,3,4,1,1,2,4,1,2],"Year":[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         "Points":[896,789,869,673,741,812,756,7    88,694,701,804,699]}
df=pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     896
1   Riders     2  2015     789
2   Devils     2  2014     869
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     699

In [106]:
df.groupby('Year').mean()

      Rank  Points
Year
2014   2.5  801.75
2015   2.5  769.50
2016   1.5  725.00
2017   1.5  743.50

In [107]:
grouped=df.groupby('Year')
grouped

In [108]:
for year,group in grouped:
    print(year)
    print(group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     896
2  Devils     2  2014     869
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    Kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     699

In [110]:
grouped.get_group(2014)   #returns the grouped data

     Team  Rank  Year  Points
0  Riders     1  2014     896
2  Devils     2  2014     869
4   Kings     3  2014     741
9  Royals     4  2014     701

In [111]:
grouped['Points'].mean()

Year
2014    801.75
2015    769.50
2016    725.00
2017    743.50
Name: Points, dtype: float64

In [112]:
grouped['Points'].sum()

Year
2014    3207
2015    3078
2016    1450
2017    1487
Name: Points, dtype: int64

In [113]:
grouped['Points'].describe()

      count    mean        std    min     25%    50%     75%    max
Year
2014    4.0  801.75  95.300839  701.0  731.00  805.0  875.75  896.0
2015    4.0  769.50  65.035888  673.0  760.00  796.5  806.00  812.0
2016    2.0  725.00  43.840620  694.0  709.50  725.0  740.50  756.0
2017    2.0  743.50  62.932504  699.0  721.25  743.5  765.75  788.0

In [114]:
#multiple aggregate functions
import numpy as np
grouped['Points'].agg([np.mean,np.sum,np.std])

        mean   sum        std
Year
2014  801.75  3207  95.300839
2015  769.50  3078  65.035888
2016  725.00  1450  43.840620
2017  743.50  1487  62.932504

In [115]:
team_group=df.groupby('Team')
team_group

In [116]:
for team,group in team_group:
    print(team)
    print(group)

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     869
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
5  Kings     4  2015     812
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     896
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     699
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

In [117]:
team_group['Points'].mean()

Team
Devils    771.00
Kings     774.25
Riders    769.50
Royals    752.50
Name: Points, dtype: float64

## missing data

In [1]:
#missing data 
#many machine learning and statistical models cant work with missing data .pandas display the missing data as NaN or NaT
#drop data
#fill data
#checking for misssing values
import pandas as pd
import numpy as np

### checking for misssing values

In [2]:
df=pd.read_csv('movie_scores.csv')
df.head()

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [3]:
df.shape

(5, 6)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   first_name        4 non-null      object
 1   last_name         4 non-null      object
 2   age               4 non-null      float64
 3   sex               4 non-null      object
 4   pre_movie_score   3 non-null      float64
 5   post_movie_score  3 non-null      float64
dtypes: float64(3), object(3)
memory usage: 368.0+ bytes

In [5]:
df.columns

Index(['first_name', 'last_name', 'age', 'sex', 'pre_movie_score',
       'post_movie_score'],
      dtype='object')

In [6]:
df.describe()

            age  pre_movie_score  post_movie_score
count   4.00000              3.0               3.0
mean   52.75000              7.0               9.0
std    15.88238              1.0               1.0
min    31.00000              6.0               8.0
25%    46.00000              6.5               8.5
50%    57.00000              7.0               9.0
75%    63.75000              7.5               9.5
max    66.00000              8.0              10.0

In [7]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [8]:
##checking for misssing values
#isnull()
#it gives True where there is mising value
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [9]:
df.isnull().sum()

first_name          1
last_name           1
age                 1
sex                 1
pre_movie_score     2
post_movie_score    2
dtype: int64

In [10]:
#drop missing data
#dropna()
#it will remove all the rows with missing or NaN values.
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [11]:
df.dropna(thresh=1)
#keep the rows with atleast 1 non-NA value

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [12]:
#subset = look into specific column for missing values and drop that rows

df.dropna(subset=['first_name'])

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [13]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [14]:
df.dropna(subset=['first_name','pre_movie_score'])

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [15]:
#filling missing data
#fillna()
#fill with a scaler value
df.fillna(0)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
1          0         0   0.0   0              0.0               0.0
2       Hugh   Jackman  51.0   m              0.0               0.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [16]:
df.mean()

C:\Users\DJ\AppData\Local\Temp/ipykernel_2156/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

age                 52.75
pre_movie_score      7.00
post_movie_score     9.00
dtype: float64

In [17]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [18]:
df.fillna(df.mean())

C:\Users\DJ\AppData\Local\Temp/ipykernel_2156/634187881.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean())

  first_name last_name    age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.00    m              8.0              10.0
1        NaN       NaN  52.75  NaN              7.0               9.0
2       Hugh   Jackman  51.00    m              7.0               9.0
3      Oprah   Winfrey  66.00    f              6.0               8.0
4       Emma     Stone  31.00    f              7.0               9.0

In [19]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean())

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [20]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [21]:
#forword fill (ffill or pad)
#value above the NaN value will be taken at place of NaN value
df.fillna(method='pad')

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
1        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [22]:
#backword fill or backfill
#value below the NaN value will be taken at place of NaN value
df.fillna(method='backfill')

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
1       Hugh   Jackman  51.0   m              6.0               8.0
2       Hugh   Jackman  51.0   m              6.0               8.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

## Conditional selection

In [23]:
df=pd.DataFrame(np.random.randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A -1.729856 -1.844668 -0.345266 -0.385965
B  0.037492  1.257099  0.020547 -0.649603
C -2.156156  0.649276  1.908271  0.426660
D -1.999691 -0.426654 -0.884251  1.890600
E -0.315965  0.354313 -0.900023 -1.754783

In [24]:
df>0

       W      X      Y      Z
A  False  False  False  False
B   True   True   True  False
C  False   True   True   True
D  False  False  False   True
E  False   True  False  False

In [25]:
df[df>0]

          W         X         Y        Z
A       NaN       NaN       NaN      NaN
B  0.037492  1.257099  0.020547      NaN
C       NaN  0.649276  1.908271  0.42666
D       NaN       NaN       NaN  1.89060
E       NaN  0.354313       NaN      NaN

In [26]:
df['X']<0

A     True
B    False
C    False
D     True
E    False
Name: X, dtype: bool

In [27]:
df[df['X']<0]

          W         X         Y         Z
A -1.729856 -1.844668 -0.345266 -0.385965
D -1.999691 -0.426654 -0.884251  1.890600

In [28]:
df>1

       W      X      Y      Z
A  False  False  False  False
B  False   True  False  False
C  False  False   True  False
D  False  False  False   True
E  False  False  False  False

In [29]:
df[df>1]

    W         X         Y       Z
A NaN       NaN       NaN     NaN
B NaN  1.257099       NaN     NaN
C NaN       NaN  1.908271     NaN
D NaN       NaN       NaN  1.8906
E NaN       NaN       NaN     NaN

In [30]:
df['X']>1

A    False
B     True
C    False
D    False
E    False
Name: X, dtype: bool

In [31]:
df[df['X']>1]

          W         X         Y         Z
B  0.037492  1.257099  0.020547 -0.649603

In [32]:
[df['W']>0]

[A    False
 B     True
 C    False
 D    False
 E    False
 Name: W, dtype: bool]

In [33]:
df[df['W']>0]

          W         X         Y         Z
B  0.037492  1.257099  0.020547 -0.649603

In [34]:
df[df['W']>0][['Y','Z']]

          Y         Z
B  0.020547 -0.649603

### multiple conditions

In [35]:
df

          W         X         Y         Z
A -1.729856 -1.844668 -0.345266 -0.385965
B  0.037492  1.257099  0.020547 -0.649603
C -2.156156  0.649276  1.908271  0.426660
D -1.999691 -0.426654 -0.884251  1.890600
E -0.315965  0.354313 -0.900023 -1.754783

In [36]:
#multiple conditions
df['W']>0

A    False
B     True
C    False
D    False
E    False
Name: W, dtype: bool

In [37]:
df['X']<0

A     True
B    False
C    False
D     True
E    False
Name: X, dtype: bool

In [38]:
#and operator (both condtions must be true)
(df['W']>0) & (df['X']<0)

A    False
B    False
C    False
D    False
E    False
dtype: bool

In [39]:
df[(df['W']>0) & (df['X']<0)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [40]:
(df['W']>0)

A    False
B     True
C    False
D    False
E    False
Name: W, dtype: bool

In [41]:
(df['Y']<0)

A     True
B    False
C    False
D     True
E     True
Name: Y, dtype: bool

In [43]:
df[(df['W']>0) & (df['Y']<0)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [44]:
# or operator(any one of 2 conditions be true)
(df['W']>0) | (df['X']<0)

A     True
B     True
C    False
D     True
E    False
dtype: bool

In [45]:
df[(df['W']>0) | (df['X']<0)]

          W         X         Y         Z
A -1.729856 -1.844668 -0.345266 -0.385965
B  0.037492  1.257099  0.020547 -0.649603
D -1.999691 -0.426654 -0.884251  1.890600

In [46]:
df=pd.read_csv('hotel_booking_data.csv')
df.head()

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date,name,email,phone-number,credit_card
0,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,Transient,0.0,0,0,Check-Out,2015-07-01,Ernest Barnes,Ernest.Barnes31@outlook.com,669-792-1661,************4322
1,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,Transient,0.0,0,0,Check-Out,2015-07-01,Andrea Baker,Andrea_Baker94@aol.com,858-637-6955,************9157
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,Transient,75.0,0,0,Check-Out,2015-07-02,Rebecca Parker,Rebecca_Parker@comcast.net,652-885-2745,************3734
3,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,Transient,75.0,0,0,Check-Out,2015-07-02,Laura Murray,Laura_M@gmail.com,364-656-8427,************5677
4,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,Transient,98.0,0,1,Check-Out,2015-07-03,Linda Hines,LHines@verizon.com,713-226-5883,************5498

In [47]:
df.shape

(119390, 36)

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119390 entries, 0 to 119389
Data columns (total 36 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   hotel                           119390 non-null  object
 1   is_canceled                     119390 non-null  int64
 2   lead_time                       119390 non-null  int64
 3   arrival_date_year               119390 non-null  int64
 4   arrival_date_month              119390 non-null  object
 5   arrival_date_week_number        119390 non-null  int64
 6   arrival_date_day_of_month       119390 non-null  int64
 7   stays_in_weekend_nights         119390 non-null  int64
 8   stays_in_week_nights            119390 non-null  int64
 9   adults                          119390 non-null  int64
 10  children                        119386 non-null  float64
 11  babies                          119390 non-null  int64
 12  meal                            119390 non-null  object
 13  country                         118902 non-null  object
 14  market_segment                  119390 non-null  object
 15  distribution_channel            119390 non-null  object
 16  is_repeated_guest               119390 non-null  int64
 17  previous_cancellations          119390 non-null  int64
 18  previous_bookings_not_canceled  119390 non-null  int64
 19  reserved_room_type              119390 non-null  object
 20  assigned_room_type              119390 non-null  object
 21  booking_changes                 119390 non-null  int64
 22  deposit_type                    119390 non-null  object
 23  agent                           103050 non-null  float64
 24  company                         6797 non-null    float64
 25  days_in_waiting_list            119390 non-null  int64
 26  customer_type                   119390 non-null  object
 27  adr                             119390 non-null  float64
 28  required_car_parking_spaces     119390 non-null  int64
 29  total_of_special_requests       119390 non-null  int64
 30  reservation_status              119390 non-null  object
 31  reservation_status_date         119390 non-null  object
 32  name                            119390 non-null  object
 33  email                           119390 non-null  object
 34  phone-number                    119390 non-null  object
 35  credit_card                     119390 non-null  object
dtypes: float64(4), int64(16), object(16)
memory usage: 32.8+ MB

In [49]:
df[df['lead_time']<10]

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date,name,email,phone-number,credit_card
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,Transient,75.00,0,0,Check-Out,2015-07-02,Rebecca Parker,Rebecca_Parker@comcast.net,652-885-2745,************3734
6,Resort Hotel,0,0,2015,July,27,1,0,2,2,...,Transient,107.00,0,0,Check-Out,2015-07-03,Dylan Rangel,Rangel.Dylan@comcast.net,420-332-5209,************6994
7,Resort Hotel,0,9,2015,July,27,1,0,2,2,...,Transient,103.00,0,1,Check-Out,2015-07-03,William Velez,Velez_William@mail.com,286-669-4333,************8729
18,Resort Hotel,0,0,2015,July,27,1,0,1,2,...,Transient,107.42,0,0,Check-Out,2015-07-02,Curtis Rodriguez,CRodriguez@verizon.com,466-424-2102,************1179
19,Resort Hotel,0,7,2015,July,27,1,0,4,2,...,Transient,153.00,0,1,Check-Out,2015-07-05,Stephanie Schmidt,StephanieSchmidt@hotmail.com,896-642-1049,************1110
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119270,City Hotel,0,0,2017,August,35,29,0,3,2,...,Transient,135.00,0,2,Check-Out,2017-09-01,Robin Allen,Robin.A@comcast.net,534-277-7374,************5887
119304,City Hotel,0,4,2017,August,35,30,0,3,1,...,Transient,140.70,0,0,Check-Out,2017-09-02,Jessica Edwards,Edwards.Jessica@yahoo.com,282-450-1672,************1492
119312,City Hotel,0,4,2017,August,35,31,0,3,2,...,Transient,132.67,0,1,Check-Out,2017-09-03,Travis Contreras,TravisContreras96@zoho.com,721-515-0841,************9669
119316,City Hotel,0,1,2017,August,35,31,0,3,2,...,Transient,109.50,0,1,Check-Out,2017-09-03,Kayla Duncan,KDuncan@gmail.com,331-276-2738,************7339
119324,City Hotel,0,8,2017,August,35,31,0,3,2,...,Transient,119.40,0,0,Check-Out,2017-09-03,Maria Martinez,Maria.M13@outlook.com,883-580-8636,************7576

In [50]:
df[df['lead_time']<10][['arrival_date_year','arrival_date_month']]

        arrival_date_year arrival_date_month
2                    2015               July
6                    2015               July
7                    2015               July
18                   2015               July
19                   2015               July
...                   ...                ...
119270               2017             August
119304               2017             August
119312               2017             August
119316               2017             August
119324               2017             August

[21876 rows x 2 columns]

In [51]:
df[(df['lead_time']<10) & (df['arrival_date_year']==2017)]

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date,name,email,phone-number,credit_card
9805,Resort Hotel,1,6,2017,January,1,4,0,1,1,...,Transient,39.00,0,0,Canceled,2017-01-03,Danielle Schmidt,Danielle.S85@yahoo.com,765-796-5559,************1073
9813,Resort Hotel,1,4,2017,January,1,5,0,3,2,...,Transient,48.00,0,0,Canceled,2017-01-01,James Williams,JWilliams23@protonmail.com,532-860-3797,************9317
9818,Resort Hotel,1,2,2017,January,1,6,2,3,1,...,Transient,43.00,0,1,No-Show,2017-01-06,Jenny Davis,JDavis54@protonmail.com,983-165-7445,************3336
9838,Resort Hotel,1,0,2017,January,2,10,0,1,2,...,Transient,0.00,0,0,Canceled,2017-01-10,Casey Mayo DDS,DDS_Casey66@mail.com,546-032-4563,************5791
9840,Resort Hotel,1,1,2017,January,2,11,0,1,1,...,Transient,41.00,0,0,Canceled,2017-01-10,Robert Hall,Robert_Hall@aol.com,958-148-0981,************7088
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119270,City Hotel,0,0,2017,August,35,29,0,3,2,...,Transient,135.00,0,2,Check-Out,2017-09-01,Robin Allen,Robin.A@comcast.net,534-277-7374,************5887
119304,City Hotel,0,4,2017,August,35,30,0,3,1,...,Transient,140.70,0,0,Check-Out,2017-09-02,Jessica Edwards,Edwards.Jessica@yahoo.com,282-450-1672,************1492
119312,City Hotel,0,4,2017,August,35,31,0,3,2,...,Transient,132.67,0,1,Check-Out,2017-09-03,Travis Contreras,TravisContreras96@zoho.com,721-515-0841,************9669
119316,City Hotel,0,1,2017,August,35,31,0,3,2,...,Transient,109.50,0,1,Check-Out,2017-09-03,Kayla Duncan,KDuncan@gmail.com,331-276-2738,************7339
119324,City Hotel,0,8,2017,August,35,31,0,3,2,...,Transient,119.40,0,0,Check-Out,2017-09-03,Maria Martinez,Maria.M13@outlook.com,883-580-8636,************7576

## time methods or pd.to_datetime

In [53]:
#US FORMAT OR STANDARD FORMAT
# year-month-date
#hr:min:sec:misec

In [54]:
import datetime
a=datetime.datetime.now()
a

datetime.datetime(2022, 3, 19, 7, 25, 24, 361913)

In [55]:
#pd.to_datetime
#to convert string like dates into main form (year-month-date)
import pandas as pd
a="2021/5/21"

In [56]:
#a.year

In [57]:
type(a)

str

In [58]:
b=pd.to_datetime(a)
b

Timestamp('2021-05-21 00:00:00')

In [59]:
type(b)

pandas._libs.tslibs.timestamps.Timestamp

In [60]:
b.year

2021

In [61]:
b.month

5

In [62]:
b.dayofweek

4

In [63]:
c='Aug 30 2020'
#pd.to_datetime(c)

In [64]:
type(c)

str

In [65]:
d=pd.to_datetime(c)
d

Timestamp('2020-08-30 00:00:00')

In [66]:
type(d)

pandas._libs.tslibs.timestamps.Timestamp

In [67]:
d.year

2020

In [68]:
d.day_name()

'Sunday'

In [69]:
style_date = '12--Dec--2000'
pd.to_datetime(style_date,format='%d--%b--%Y')
#%d =day ,%b = month , %Y =year

Timestamp('2000-12-12 00:00:00')

In [70]:
df=pd.read_csv('RetailSales_BeerWineLiquor.csv')
df.head()

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597
3  1992-04-01           1675
4  1992-05-01           1822

In [71]:
df['DATE'][0]

'1992-01-01'

In [72]:
type(df['DATE'][0])

str

In [73]:
df['DATE']=pd.to_datetime(df['DATE'])

In [74]:
type(df['DATE'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [75]:
df=df.set_index('DATE')
df.head()

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822

In [ ]:
#resample 
#When calling .resample() you first need to pass in a rule parameter, then you need to call some sort of aggregation function.

#The rule parameter describes the frequency with which to apply the aggregation function (daily, monthly, yearly, etc.)

'''ALIAS	DESCRIPTION
B	business day frequency
C	custom business day frequency (experimental)
D	calendar day frequency
W	weekly frequency
M	month end frequency
SM	semi-month end frequency (15th and end of month)
BM	business month end frequency
CBM	custom business month end frequency
MS	month start frequency
SMS	semi-month start frequency (1st and 15th)
BMS	business month start frequency
CBMS	custom business month start frequency
Q	quarter end frequency
intentionally left blank
 
ALIAS	DESCRIPTION
BQ	business quarter endfrequency
QS	quarter start frequency
BQS	business quarter start frequency
A	year end frequency
BA	business year end frequency
AS	year start frequency
BAS	business year start frequency
BH	business hour frequency
H	hourly frequency
T, min	minutely frequency
S	secondly frequency
L, ms	milliseconds
U, us	microseconds
N	nanoseconds'''

In [76]:
#rule='A' means Yearly
df.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [77]:
df.resample(rule='M').mean()

            MRTSSM4453USN
DATE
1992-01-31         1509.0
1992-02-29         1541.0
1992-03-31         1597.0
1992-04-30         1675.0
1992-05-31         1822.0
...                   ...
2019-12-31         6630.0
2020-01-31         4388.0
2020-02-29         4533.0
2020-03-31         5562.0
2020-04-30         5207.0

[340 rows x 1 columns]

In [78]:
#H	hourly frequency
df.resample(rule='H').mean()

                     MRTSSM4453USN
DATE
1992-01-01 00:00:00         1509.0
1992-01-01 01:00:00            NaN
1992-01-01 02:00:00            NaN
1992-01-01 03:00:00            NaN
1992-01-01 04:00:00            NaN
...                            ...
2020-03-31 20:00:00            NaN
2020-03-31 21:00:00            NaN
2020-03-31 22:00:00            NaN
2020-03-31 23:00:00            NaN
2020-04-01 00:00:00         5207.0

[247633 rows x 1 columns]

## Operations

### nunique

In [79]:
#nunique
#it gives no.of unique values in every column

In [80]:
#OPERATIONS
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],"col3":['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [81]:
df['col1'].nunique()

4

In [82]:
df['col2'].nunique()

3

In [83]:
#unique
#it gives all unique values
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [84]:
df['col3'].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

## value_counts()

In [85]:
#value_counts()
#how many times each unique value has occured
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [86]:
df['col1'].value_counts()

1    1
2    1
3    1
4    1
Name: col1, dtype: int64

In [87]:
df=pd.DataFrame({'k1':['A','A','B','B','C','C'],'k2':[100,200,300,300,400,500],'k3':['NY','CA','WA','WA','AK','NV']})
df

  k1   k2  k3
0  A  100  NY
1  A  200  CA
2  B  300  WA
3  B  300  WA
4  C  400  AK
5  C  500  NV

In [88]:
df['k2'].unique()

array([100, 200, 300, 400, 500], dtype=int64)

In [89]:
df['k2'].value_counts()

300    2
100    1
200    1
400    1
500    1
Name: k2, dtype: int64

In [90]:
#It will gives u the number of unique values.
import pandas as pd
df=pd.read_csv('hotel_booking_data.csv')
df.head()

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date,name,email,phone-number,credit_card
0,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,Transient,0.0,0,0,Check-Out,2015-07-01,Ernest Barnes,Ernest.Barnes31@outlook.com,669-792-1661,************4322
1,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,Transient,0.0,0,0,Check-Out,2015-07-01,Andrea Baker,Andrea_Baker94@aol.com,858-637-6955,************9157
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,Transient,75.0,0,0,Check-Out,2015-07-02,Rebecca Parker,Rebecca_Parker@comcast.net,652-885-2745,************3734
3,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,Transient,75.0,0,0,Check-Out,2015-07-02,Laura Murray,Laura_M@gmail.com,364-656-8427,************5677
4,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,Transient,98.0,0,1,Check-Out,2015-07-03,Linda Hines,LHines@verizon.com,713-226-5883,************5498

In [91]:
df['hotel'].value_counts()

City Hotel      79330
Resort Hotel    40060
Name: hotel, dtype: int64

In [92]:
df['hotel'].nunique()

2

In [93]:
df['hotel'].unique()

array(['Resort Hotel', 'City Hotel'], dtype=object)

In [94]:
df['is_canceled'].unique()

array([0, 1], dtype=int64)

In [95]:
df['is_canceled'].value_counts()

0    75166
1    44224
Name: is_canceled, dtype: int64

## #apply method(IMP)

In [96]:
#apply method(IMP)
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],"col3":['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [97]:
def square(num):
    return num**2

In [98]:
df['col1'].apply(square)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [99]:
df['col1'].apply(lambda num:num**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [100]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [101]:
def first_letter(name):
    return name[0]

In [102]:
df['col3'].apply(first_letter)

0    a
1    d
2    g
3    x
Name: col3, dtype: object

In [103]:
df['col3'].apply(lambda text:text[0])

0    a
1    d
2    g
3    x
Name: col3, dtype: object

In [104]:
def add(text):
    return text + "p"

In [105]:
df['col3'].apply(add)

0    abcp
1    defp
2    ghip
3    xyzp
Name: col3, dtype: object

In [106]:
df['col3'].apply(lambda text:text+"p")

0    abcp
1    defp
2    ghip
3    xyzp
Name: col3, dtype: object

### apply function on multiple columns

In [107]:
def add_ten_every_row(num):
    return num+10

In [108]:
df[['col1','col2']].apply(add_ten_every_row)

   col1  col2
0    11   454
1    12   565
2    13   676
3    14   454

In [109]:
import pandas as pd
df=pd.read_csv('movie_scores.csv')
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [110]:
df=df.dropna()
df

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [111]:
def Multiply_by_two(num):
    return num*2

In [112]:
import numpy as np
import warnings
warnings.filterwarnings('ignore')
df[['pre_movie_score','post_movie_score']].apply(Multiply_by_two)

   pre_movie_score  post_movie_score
0             16.0              20.0
3             12.0              16.0
4             14.0              18.0

In [113]:
df[['pre_movie_score','post_movie_score']].apply(np.vectorize(Multiply_by_two))

   pre_movie_score  post_movie_score
0             16.0              20.0
3             12.0              16.0
4             14.0              18.0

In [114]:
df['New column']=df[['pre_movie_score','post_movie_score']].sum(axis=1)

In [115]:
df

,first_name,last_name,age,sex,pre_movie_score,post_movie_score,New column
0,Tom,Hanks,63.0,m,8.0,10.0,18.0
3,Oprah,Winfrey,66.0,f,6.0,8.0,14.0
4,Emma,Stone,31.0,f,7.0,9.0,16.0

In [116]:
df['New column']=df[['pre_movie_score','post_movie_score']].max(axis=1)

In [117]:
df

,first_name,last_name,age,sex,pre_movie_score,post_movie_score,New column
0,Tom,Hanks,63.0,m,8.0,10.0,10.0
3,Oprah,Winfrey,66.0,f,6.0,8.0,8.0
4,Emma,Stone,31.0,f,7.0,9.0,9.0

# ONE HOT ENCODING
# pd.get_dummies()

In [118]:
##to convert categorical columns to numeric columns

In [119]:
import pandas as pd
df = pd.DataFrame({'Name':['John Smith', 'Mary Brown','Rishi kakde'],
                     'Gender':['M', 'F','M'], 'Smoker':['Y', 'N','N']})
df

          Name Gender Smoker
0   John Smith      M      Y
1   Mary Brown      F      N
2  Rishi kakde      M      N

In [120]:
df['Gender'].unique()

array(['M', 'F'], dtype=object)

In [121]:
df['Smoker'].unique()

array(['Y', 'N'], dtype=object)

In [122]:
x={'Y':1,"N":0,'M':1,'F':0}

In [123]:
varlist=['Gender','Smoker']

In [124]:
df[varlist]

  Gender Smoker
0      M      Y
1      F      N
2      M      N

In [125]:
df[varlist]=df[varlist].apply(lambda x:x.map({'Y':1,"N":0,'M':1,'F':0}))

In [126]:
df

          Name  Gender  Smoker
0   John Smith       1       1
1   Mary Brown       0       0
2  Rishi kakde       1       0

In [127]:
import pandas as pd
df = pd.DataFrame({'Name':['John Smith', 'Mary Brown','Rishi kakde'],
                     'Gender':['M', 'F','M'], 'Smoker':['Y', 'N','N']})
df

          Name Gender Smoker
0   John Smith      M      Y
1   Mary Brown      F      N
2  Rishi kakde      M      N

In [128]:
df['Gender']=df['Gender'].map(x)

In [129]:
df['Smoker']=df['Smoker'].map(x)

In [130]:
df

          Name  Gender  Smoker
0   John Smith       1       1
1   Mary Brown       0       0
2  Rishi kakde       1       0

In [131]:
import pandas as pd

ids = [11, 22, 33, 44, 55, 66, 77]
countries = ['Spain', 'France', 'Spain', 'Germany', 'France']

df = pd.DataFrame(list(zip(ids, countries)),
                  columns=['Ids', 'Countries'])

In [132]:
df

   Ids Countries
0   11     Spain
1   22    France
2   33     Spain
3   44   Germany
4   55    France

In [133]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Ids        5 non-null      int64
 1   Countries  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [134]:
df['Countries'].unique()

array(['Spain', 'France', 'Germany'], dtype=object)

In [135]:
pd.get_dummies(df['Countries'])

   France  Germany  Spain
0       0        0      1
1       1        0      0
2       0        0      1
3       0        1      0
4       1        0      0

In [136]:
df=pd.get_dummies(df['Countries'],drop_first=True)

In [137]:
df

   Germany  Spain
0        0      1
1        0      0
2        0      1
3        1      0
4        0      0

In [138]:
import pandas as pd
df = pd.DataFrame({'Name':['John Smith', 'Mary Brown','Rishi kakde'],
                     'Gender':['M', 'F','M'], 'Smoker':['Y', 'N','N']})
df

          Name Gender Smoker
0   John Smith      M      Y
1   Mary Brown      F      N
2  Rishi kakde      M      N

In [139]:
df=pd.get_dummies(df,drop_first=True)

In [140]:
df

   Name_Mary Brown  Name_Rishi kakde  Gender_M  Smoker_Y
0                0                 0         1         1
1                1                 0         0         0
2                0                 1         1         0

In [141]:
import pandas as pd
df=pd.read_csv('Housing.csv')
df.head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished

In [142]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 545 entries, 0 to 544
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   price             545 non-null    int64
 1   area              545 non-null    int64
 2   bedrooms          545 non-null    int64
 3   bathrooms         545 non-null    int64
 4   stories           545 non-null    int64
 5   mainroad          545 non-null    object
 6   guestroom         545 non-null    object
 7   basement          545 non-null    object
 8   hotwaterheating   545 non-null    object
 9   airconditioning   545 non-null    object
 10  parking           545 non-null    int64
 11  prefarea          545 non-null    object
 12  furnishingstatus  545 non-null    object
dtypes: int64(6), object(7)
memory usage: 55.5+ KB

In [143]:
df['furnishingstatus'].unique()

array(['furnished', 'semi-furnished', 'unfurnished'], dtype=object)

In [144]:
furnished_dummy=pd.get_dummies(df['furnishingstatus'],drop_first=True)
furnished_dummy

     semi-furnished  unfurnished
0                 0            0
1                 0            0
2                 1            0
3                 0            0
4                 0            0
..              ...          ...
540               0            1
541               1            0
542               0            1
543               0            0
544               0            1

[545 rows x 2 columns]

In [145]:
df=pd.concat([df,furnished_dummy],axis=1)

In [146]:
df.head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus,semi-furnished,unfurnished
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished,0,0
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished,0,0
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished,1,0
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished,0,0
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished,0,0

In [147]:
df=df.drop(df[['furnishingstatus']],axis=1)

In [148]:
df.head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,semi-furnished,unfurnished
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,0,0
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,0,0
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,1,0
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,0,0
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,0,0

In [149]:
df['mainroad'].unique()

array(['yes', 'no'], dtype=object)

In [150]:
df['hotwaterheating'].unique()

array(['no', 'yes'], dtype=object)

In [151]:
varlist = ['mainroad','guestroom','basement','hotwaterheating','airconditioning','prefarea']

In [152]:
df[varlist]= df[varlist].apply(lambda x:x.map({'yes':1,'no':0}))

In [153]:
df.head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,semi-furnished,unfurnished
0,13300000,7420,4,2,3,1,0,0,0,1,2,1,0,0
1,12250000,8960,4,4,4,1,0,0,0,1,3,0,0,0
2,12250000,9960,3,2,2,1,0,1,0,0,2,1,1,0
3,12215000,7500,4,2,2,1,0,1,0,1,3,1,0,0
4,11410000,7420,4,1,2,1,1,1,0,1,2,0,0,0

In [154]:
#PANDAS I/O 
#data input & output
#1 csv file 
#df=pd.read_csv('name of csv file')
import pandas as pd
df=pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [155]:
#how to save this dataframe into a csv file
df.to_csv('itvedant_9march',index=False)

In [156]:
df=pd.read_csv('itvedant_9march')

In [157]:
df.head()

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## Reading excel file

In [158]:
#excel file
#!pip install xlrd
df=pd.read_excel('example.xlsx',sheet_name='First_Sheet')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [159]:
#to save the dataframe as a excel file
df.to_excel('excel_itvedant9_DS.xlsx',sheet_name='new',index=False)

In [160]:
df=pd.read_excel('excel_itvedant9_DS.xlsx',sheet_name='new')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## reading json file

In [162]:
#json
#pd.read_json('json file name')
#json is kind of dictionary in which key is also string and value is also string

In [163]:
df = pd.read_json('akshay.json', orient='split')
df.head()

,_id,categories,isActive,imageUrl,barcode,isFmcg,itemName,mrp,_created_at,_updated_at
0,OzE5vaa3p7,"[{'__type': 'Pointer', 'className': 'Category'...",True,https://firebasestorage.googleapis.com/v0/b/sh...,8908001921015,True,Anil puttu flour 500g,58,2016-10-02 13:49:03.281000+00:00,2017-02-22 08:48:09.548000+00:00
1,ENPCL8ph1p,"[{'__type': 'Pointer', 'className': 'Category'...",True,https://firebasestorage.googleapis.com/v0/b/ki...,8901725181222,True,"Yippee Magic Masala Noodles, 70 G",12,2016-10-02 13:49:03.284000+00:00,2017-02-22 08:48:09.074000+00:00

In [164]:
df.to_json('itvedant9_DS.json')

In [165]:
df = pd.read_json('itvedant9_DS.json')
df.head()

,_id,categories,isActive,imageUrl,barcode,isFmcg,itemName,mrp,_created_at,_updated_at
0,OzE5vaa3p7,"[{'__type': 'Pointer', 'className': 'Category'...",True,https://firebasestorage.googleapis.com/v0/b/sh...,8908001921015,True,Anil puttu flour 500g,58,2016-10-02 13:49:03.281,2017-02-22 08:48:09.548
1,ENPCL8ph1p,"[{'__type': 'Pointer', 'className': 'Category'...",True,https://firebasestorage.googleapis.com/v0/b/ki...,8901725181222,True,"Yippee Magic Masala Noodles, 70 G",12,2016-10-02 13:49:03.284,2017-02-22 08:48:09.074

In [166]:
#read_html
#html file
#pd.read_html('html link or url')